tutorials/multiphaseEuler/condenser/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultValues
{
    alpha.gas       1;
    alpha.liquid    0;
    alpha.solid     0;
}

zones
{
    dryer
    {
        type            lookup;

        values
        {
            alpha.gas       0.8;
            alpha.liquid    0;
            alpha.solid     0.2;
        }
    }
}

// ************************************************************************* //
